content/it/docs/80 Progetti/ProgettoMipaf/Esempi di XML per la modalita_web-service/Sostanze Zuccherine/Asincroni/CancSoggSiRSoZ.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://cooperazione.sian.it/schema/SoapAutenticazione" xmlns:wsm="http://cooperazione.sian.it/schema/wsmrgc/">
   <soapenv:Header>
      <soap:SOAPAutenticazione>
         <!--Credenziali rilasciate dal Ministero all'azienda-->
         <username>AAAAAAAAAA</username>
         <password>BBBBBBBBBB</password>
         <nomeServizio>CancSoggSiRSoZ</nomeServizio>
      </soap:SOAPAutenticazione>
   </soapenv:Header>
   <soapenv:Body>
      <wsm:CancSoggSiRSoZInput>
         <wsm:CodOper>
            <!--Indicazione del Codice Fiscale dell'azienda (valorizzare persona fisica o giuridica)-->
            <wsm:PersonaGiuridica>01234567890</wsm:PersonaGiuridica>
         </wsm:CodOper>
         <!--Codice ICQRF dello stabilimento nel formato AANNNN-->
         <wsm:CodiceIcqrf>RM1234</wsm:CodiceIcqrf>
         <!--Specificare una o pi soggetti da cancellare-->
         <wsm:SoggettoElimina>
            <!--Codice alfanumerico del soggetto presente in ANAGRAFICA-->
            <wsm:CodiceSoggetto>AA1824</wsm:CodiceSoggetto>
         </wsm:SoggettoElimina>
         <wsm:SoggettoElimina>
            <!--Codice alfanumerico del soggetto presente in ANAGRAFICA-->
            <wsm:CodiceSoggetto>3234</wsm:CodiceSoggetto>
         </wsm:SoggettoElimina>
      </wsm:CancSoggSiRSoZInput>
   </soapenv:Body>
</soapenv:Envelope>